tutorials/incompressible/pUCoupledFoam/cavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Up
    {
        solver BiCGStab;
        preconditioner Cholesky;

        tolerance 1e-09;
        relTol  0.0;

        minIter 1;
        maxIter 500;
    }

//     Up
//     {
//         solver          AMG;
//         cycle           V-cycle;
//         coarseningType  AAMG;
//         norm            componentNorm;
//         normComponent   0;

//         nPreSweeps      4;
//         nPostSweeps     4;
//         groupSize       2;
//         minCoarseEqns   4;
//         nMaxLevels      10;
//         scale           on;
//         fineSmoother    ILU;
//         coarseSmoother k ILU;

//         minIter         0;
//         maxIter         100;
//         tolerance       1e-7;
//         relTol          0.01;
//     }

    // Segregated
    p
    {
        solver           CG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    }
}

blockSolver
{
    convergence 1e-6;

    pRefCell 0;
    pRefValue 0;
}

fieldBounds
{
    U      500;
    p      -5e4 5e4;
}

relaxationFactors
{
    U   0.999;
}


// ************************************************************************* //
